src/cfe/InformationRegisters/кбп_Замещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>кбп_Замещения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Уведомлять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВозвращатьЗадачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Замещаемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Замещающий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_СхемыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/InformationRegisters/кбп_ИсполнителиШагов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>кбп_ИсполнителиШагов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособАдресации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_СпособыАдресации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьОбъектаАдресации1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьОбъектаАдресации2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РеквизитПредмета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обработчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ОбработчикиПроцессов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Условие</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Шаг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ЭлементыСхем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗаписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/InformationRegisters/кбп_ИсполнителиРолей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>кбп_ИсполнителиРолей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАдресации1</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАдресации2</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/Enums/кбп_СпособыАдресации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>кбп_СпособыАдресации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пользователь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Роль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнительПредыдущегоШага</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзРеквизита</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбираетПредыдущий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Enums/кбп_СостоянияЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>кбп_СостоянияЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ожидает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возвращена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переадресована</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Catalogs/кбп_Задачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>кбп_Задачи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_Процессы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ЭлементыСхем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдМаркера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_СостоянияЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначенный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектАдресации1</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектАдресации2</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Замещение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.кбп_Замещение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятаКИсполнению</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринялКИсполнению</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПринятия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Итерация</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКопия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПредмета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/CommonModules/кбп_Адресация/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Определяет исполнителей шага по строкам кбп_ИсполнителиШагов (Архитектура п. 7).
// Замещения (этап 3) здесь не раскрываются: «Мои задачи» учитывают их при чтении.
//
// Параметры:
//  Шаг - СправочникСсылка.кбп_ЭлементыСхем
//  Контекст - Структура - контекст операции движка (Процесс, Предмет, Автор, Пользователь, Переменные, …).
//
// Возвращаемое значение:
//  Массив из см. НовыйИсполнитель
//
Функция ОпределитьИсполнителей(Шаг, Контекст) Экспорт

	Исполнители = Новый Массив;
	СтандартнаяОбработка = Истина;
	КонтекстАдресации = Новый Структура("Шаг, Процесс, Предмет, Автор, Пользователь, Переменные",
		Шаг, Контекст.Процесс, Контекст.Предмет, Контекст.Автор, Контекст.Пользователь, Контекст.Переменные);
	кбп_ПроцессыПереопределяемый.ПриОпределенииИсполнителей(КонтекстАдресации, Исполнители, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат БезПовторов(Исполнители);
	КонецЕсли;

	Способы = Перечисления.кбп_СпособыАдресации;
	Для Каждого Настройка Из НастройкиИсполнителей(Шаг) Цикл

		Если Настройка.СпособАдресации = Способы.Пользователь Тогда
			ДобавитьПользователя(Исполнители, Настройка.Пользователь);

		ИначеЕсли Настройка.СпособАдресации = Способы.Роль Тогда
			Объект1 = ЗначениеПоПути(Контекст, Настройка.ПутьОбъектаАдресации1);
			Объект2 = ЗначениеПоПути(Контекст, Настройка.ПутьОбъектаАдресации2);
			Для Каждого Пользователь Из ИсполнителиРоли(Настройка.Роль, Объект1, Объект2) Цикл
				Исполнитель = НовыйИсполнитель(Пользователь);
				Исполнитель.Роль = Настройка.Роль;
				Исполнитель.ОбъектАдресации1 = Объект1;
				Исполнитель.ОбъектАдресации2 = Объект2;
				Исполнители.Добавить(Исполнитель);
			КонецЦикла;

		ИначеЕсли Настройка.СпособАдресации = Способы.Автор Тогда
			ДобавитьПользователя(Исполнители, Контекст.Автор);

		ИначеЕсли Настройка.СпособАдресации = Способы.ИсполнительПредыдущегоШага Тогда
			ДобавитьПользователя(Исполнители, ИсполнительПредыдущегоШага(Контекст));

		ИначеЕсли Настройка.СпособАдресации = Способы.Руководитель Тогда
			ДобавитьПользователя(Исполнители, кбп_АдаптерКонфигурации.РуководительПользователя(Контекст.Автор));

		ИначеЕсли Настройка.СпособАдресации = Способы.ИзРеквизита Тогда
			Значение = ЗначениеПоПути(Контекст, Настройка.РеквизитПредмета);
			ДобавитьПользователя(Исполнители, кбп_АдаптерКонфигурации.ПользовательПоЗначению(Значение));

		ИначеЕсли Настройка.СпособАдресации = Способы.Обработчик Тогда
			Если ЗначениеЗаполнено(Настройка.Обработчик) Тогда
				КонтекстАдресации.Вставить("Исполнители", Новый Массив);
				кбп_Действия.ВыполнитьОбработчик(Настройка.Обработчик, КонтекстАдресации);
				Для Каждого Пользователь Из КонтекстАдресации.Исполнители Цикл
					ДобавитьПользователя(Исполнители, Пользователь);
				КонецЦикла;
			КонецЕсли;

		КонецЕсли;
		// ВыбираетПредыдущий — диалог выбора исполнителя при выполнении предыдущей задачи, этап 3 (ФТ-413).

	КонецЦикла;

	Возврат БезПовторов(Исполнители);

КонецФункции

// Описание исполнителя задачи.
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи
//
// Возвращаемое значение:
//  Структура - Пользователь, Роль, ОбъектАдресации1, ОбъектАдресации2.
//
Функция НовыйИсполнитель(Пользователь) Экспорт
	Возврат Новый Структура("Пользователь, Роль, ОбъектАдресации1, ОбъектАдресации2",
		Пользователь, Справочники.кбп_РолиИсполнителей.ПустаяСсылка(), Неопределено, Неопределено);
КонецФункции

// Кого замещает пользователь на дату — с цепочками: если А замещает Б, а Б замещает В, А видит задачи В (ФТ-306).
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи
//  НаДату - Дата, Неопределено - текущая дата сеанса.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Замещаемый, Роль, Схема (пустые — «все»), Документ (ДокументСсылка.кбп_Замещение).
//
Функция ЗамещаемыеПользователем(Пользователь, НаДату = Неопределено) Экспорт

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Замещаемый");
	Результат.Колонки.Добавить("Роль");
	Результат.Колонки.Добавить("Схема");
	Результат.Колонки.Добавить("Документ");
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ?(НаДату = Неопределено, ТекущаяДатаСеанса(), НаДату));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Замещения.Замещаемый КАК Замещаемый,
	|	Замещения.Роль КАК Роль,
	|	Замещения.Схема КАК Схема,
	|	Замещения.Регистратор КАК Документ
	|ИЗ
	|	РегистрСведений.кбп_Замещения КАК Замещения
	|ГДЕ
	|	Замещения.Замещающий В (&Замещающие)
	|	И Замещения.Активность
	|	И Замещения.ДатаНачала <= &Дата
	|	И (Замещения.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ Замещения.ДатаОкончания >= &Дата)";

	Обработанные = Новый Соответствие;
	Обработанные.Вставить(Пользователь, Истина);
	Текущие = Новый Массив;
	Текущие.Добавить(Пользователь);
	Пока Текущие.Количество() > 0 Цикл
		Запрос.УстановитьПараметр("Замещающие", Текущие);
		Следующие = Новый Массив;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Результат.Добавить(), Выборка);
			Если Обработанные[Выборка.Замещаемый] = Неопределено Тогда
				Обработанные.Вставить(Выборка.Замещаемый, Истина);
				Следующие.Добавить(Выборка.Замещаемый);
			КонецЕсли;
		КонецЦикла;
		Текущие = Следующие;
	КонецЦикла;
	Возврат Результат;

КонецФункции

// Кто сейчас замещает пользователя (для оповещений о его задачах, ФТ-604).
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи
//  Роль - СправочникСсылка.кбп_РолиИсполнителей - роль задачи (пусто — любая).
//  Схема - СправочникСсылка.кбп_СхемыПроцессов - схема процесса.
//
// Возвращаемое значение:
//  Массив из СправочникСсылка.Пользователи
//
Функция ЗаместителиПользователя(Пользователь, Роль = Неопределено, Схема = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Роль", Роль);
	Запрос.УстановитьПараметр("Схема", Схема);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Замещения.Замещающий КАК Замещающий
	|ИЗ
	|	РегистрСведений.кбп_Замещения КАК Замещения
	|ГДЕ
	|	Замещения.Замещаемый = &Пользователь
	|	И Замещения.Активность
	|	И Замещения.ДатаНачала <= &Дата
	|	И (Замещения.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ Замещения.ДатаОкончания >= &Дата)
	|	И (Замещения.Роль = ЗНАЧЕНИЕ(Справочник.кбп_РолиИсполнителей.ПустаяСсылка)
	|			ИЛИ Замещения.Роль = &Роль)
	|	И (Замещения.Схема = ЗНАЧЕНИЕ(Справочник.кбп_СхемыПроцессов.ПустаяСсылка)
	|			ИЛИ Замещения.Схема = &Схема)";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Замещающий");

КонецФункции

// Документ замещения, по которому пользователь может выполнить чужую задачу.
//
// Параметры:
//  Задача - СправочникСсылка.кбп_Задачи, СправочникОбъект.кбп_Задачи
//  Пользователь - СправочникСсылка.Пользователи
//
// Возвращаемое значение:
//  ДокументСсылка.кбп_Замещение, Неопределено - замещения нет.
//
Функция ЗамещениеДляЗадачи(Задача, Пользователь) Экспорт

	Если Задача.Назначенный = Пользователь Или Не ЗначениеЗаполнено(Задача.Назначенный) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Схема = Задача.Процесс.Схема;
	Для Каждого Замещение Из ЗамещаемыеПользователем(Пользователь) Цикл
		Если Замещение.Замещаемый = Задача.Назначенный
			И (Не ЗначениеЗаполнено(Замещение.Роль) Или Замещение.Роль = Задача.Роль)
			И (Не ЗначениеЗаполнено(Замещение.Схема) Или Замещение.Схема = Схема) Тогда
			Возврат Замещение.Документ;
		КонецЕсли;
	КонецЦикла;
	Возврат Неопределено;

КонецФункции

// Кому передать просроченную задачу (ФТ-308): эскалационная роль шага, эскалационная роль роли задачи,
// руководитель исполнителя; первый найденный пользователь.
//
// Параметры:
//  Задача - СправочникСсылка.кбп_Задачи
//
// Возвращаемое значение:
//  СправочникСсылка.Пользователи, Неопределено
//
Функция ИсполнительЭскалации(Задача) Экспорт

	Роль = Задача.Шаг.ЭскалационнаяРоль;
	Если Не ЗначениеЗаполнено(Роль) И ЗначениеЗаполнено(Задача.Роль) Тогда
		Роль = Задача.Роль.ЭскалационнаяРоль;
	КонецЕсли;
	Если ЗначениеЗаполнено(Роль) Тогда
		Для Каждого Пользователь Из ИсполнителиРоли(Роль, Задача.ОбъектАдресации1, Задача.ОбъектАдресации2) Цикл
			Если ЗначениеЗаполнено(Пользователь) И Пользователь <> Задача.Назначенный Тогда
				Возврат Пользователь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Руководитель = кбп_АдаптерКонфигурации.РуководительПользователя(Задача.Назначенный);
	Если ЗначениеЗаполнено(Руководитель) И Руководитель <> Задача.Назначенный Тогда
		Возврат Руководитель;
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

// Значение по пути от предмета («Контрагент.ОсновнойМенеджер») или переменной («Переменные.Сумма»).
//
// Параметры:
//  Контекст - Структура - Предмет, Переменные.
//  Путь - Строка
//
// Возвращаемое значение:
//  Произвольный, Неопределено - если путь пуст или не вычисляется.
//
Функция ЗначениеПоПути(Контекст, Знач Путь) Экспорт

	Путь = СокрЛП(Путь);
	Если Не ЗначениеЗаполнено(Путь) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Части = СтрРазделить(Путь, ".", Ложь);
	Если НРег(Части[0]) = "переменные" И Части.Количество() > 1 Тогда
		Значение = Контекст.Переменные[Части[1]];
		Начало = 2;
	Иначе
		Значение = Контекст.Предмет;
		Начало = 0;
	КонецЕсли;

	Для Индекс = Начало По Части.ВГраница() Цикл
		Если Не ЗначениеЗаполнено(Значение) Тогда
			Возврат Неопределено;
		КонецЕсли;
		Попытка
			Значение = Значение[Части[Индекс]];
		Исключение
			Возврат Неопределено;
		КонецПопытки;
	КонецЦикла;
	Возврат Значение;

КонецФункции

// Пользователи роли по объектам адресации (для оповещений роли, ФТ-604).
//
// Параметры:
//  Роль - СправочникСсылка.кбп_РолиИсполнителей
//  Объект1, Объект2 - Произвольный - объекты адресации; нет записей с ними — берутся записи роли «без объектов».
//
// Возвращаемое значение:
//  Массив из СправочникСсылка.Пользователи
//
Функция ИсполнителиРолиПоОбъектам(Роль, Объект1 = Неопределено, Объект2 = Неопределено) Экспорт
	Возврат ИсполнителиРоли(Роль, Объект1, Объект2);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НастройкиИсполнителей(Шаг)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Шаг", Шаг);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Исполнители.СпособАдресации КАК СпособАдресации,
	|	Исполнители.Роль КАК Роль,
	|	Исполнители.ПутьОбъектаАдресации1 КАК ПутьОбъектаАдресации1,
	|	Исполнители.ПутьОбъектаАдресации2 КАК ПутьОбъектаАдресации2,
	|	Исполнители.Пользователь КАК Пользователь,
	|	Исполнители.РеквизитПредмета КАК РеквизитПредмета,
	|	Исполнители.Обработчик КАК Обработчик
	|ИЗ
	|	РегистрСведений.кбп_ИсполнителиШагов КАК Исполнители
	|ГДЕ
	|	Исполнители.Шаг = &Шаг
	|
	|УПОРЯДОЧИТЬ ПО
	|	Исполнители.НомерЗаписи";
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Пользователи роли по объектам адресации. Нет записей с объектами — берутся записи роли «без объектов».
Функция ИсполнителиРоли(Роль, Объект1, Объект2)

	Список = ПользователиРоли(Роль, Объект1, Объект2);
	Если Список.Количество() = 0 И (ЗначениеЗаполнено(Объект1) Или ЗначениеЗаполнено(Объект2)) Тогда
		Список = ПользователиРоли(Роль, Неопределено, Неопределено);
	КонецЕсли;
	Возврат Список;

КонецФункции

Функция ПользователиРоли(Роль, Объект1, Объект2)

	Набор = РегистрыСведений.кбп_ИсполнителиРолей.СоздатьНаборЗаписей();
	Набор.Отбор.Роль.Установить(Роль);
	Набор.Отбор.ОбъектАдресации1.Установить(?(ЗначениеЗаполнено(Объект1), Объект1, Неопределено));
	Набор.Отбор.ОбъектАдресации2.Установить(?(ЗначениеЗаполнено(Объект2), Объект2, Неопределено));
	Набор.Прочитать();
	Таблица = Набор.Выгрузить();
	Таблица.Сортировать("Основной Убыв, Порядок");
	Возврат Таблица.ВыгрузитьКолонку("Пользователь");

КонецФункции

Функция ИсполнительПредыдущегоШага(Контекст)

	Если Контекст.Задача <> Неопределено Тогда
		Возврат Контекст.Пользователь;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Процесс", Контекст.Процесс);
	Запрос.УстановитьПараметр("Выполнена", Перечисления.кбп_СостоянияЗадач.Выполнена);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Задачи.Исполнитель КАК Исполнитель
	|ИЗ
	|	Справочник.кбп_Задачи КАК Задачи
	|ГДЕ
	|	Задачи.Процесс = &Процесс
	|	И Задачи.Состояние = &Выполнена
	|
	|УПОРЯДОЧИТЬ ПО
	|	Задачи.ДатаВыполнения УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Исполнитель, Контекст.Автор);

КонецФункции

Процедура ДобавитьПользователя(Исполнители, Пользователь)
	Если ТипЗнч(Пользователь) = Тип("СправочникСсылка.Пользователи") И ЗначениеЗаполнено(Пользователь) Тогда
		Исполнители.Добавить(НовыйИсполнитель(Пользователь));
	КонецЕсли;
КонецПроцедуры

Функция БезПовторов(Исполнители)

	Результат = Новый Массив;
	Добавленные = Новый Соответствие;
	Для Каждого Исполнитель Из Исполнители Цикл
		Если ТипЗнч(Исполнитель) <> Тип("Структура") Тогда
			Исполнитель = НовыйИсполнитель(Исполнитель);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Исполнитель.Пользователь) Или Добавленные[Исполнитель.Пользователь] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Добавленные.Вставить(Исполнитель.Пользователь, Истина);
		Результат.Добавить(Исполнитель);
	КонецЦикла;
	Возврат Результат;

КонецФункции

#КонецОбласти
